{
    "name": "Allen Frise",
    "summary": "Results-driven full stack software developer with over 10 years of experience specializing in geospatial systems, financial technology, and enterprise software solutions. Proven track record of delivering high-impact solutions in remote and office environments, with expertise in C#/.NET, Java, and modern web technologies. Demonstrated ability to lead technical initiatives while maintaining a focus on code quality and user experience.",
    "skills": [
        "Programming in languages including C/C++, C#, Java, JavaScript/TypeScript, Python",
        "Ability to work independently and in groups",
        "Scripting in PHP, SQL, HTML5, JavaScript",
        "Debugging source code",
        "Command line scripting in Linux and Windows",
        "Troubleshooting software issues",
        "Communicating with clients and coworkers to ensure effective delivery of product"],
        "educations": [
            {"school": "J Sargeant Reynolds", "major": "Computer Science", "tenure": "2005-2008"}, 
            {"school": "Western Governor's University", "major": "Software Engineering", "tenure":"2022 - Present"}],
    "experiences": [
         {"name": "VertiGIS", 
            "title": "Software Developer", 
            "location": "Richmond, VA",
            "tenure": "03/2020 - Present", 
            "responsibilities": [
                "develop enhanced integrations with external data systems", 
                "work remotely with a team in a constantly shifiting environment",
                "maintain code in many facets of complex geospatial mapping software"
            ]},
        {"name": "Computer Resource Company", 
            "title": "Software Developer", 
            "location": "Richmond, VA",
            "tenure": "01/2018 - 06/2019", 
            "responsibilities": [
                "Designed and implemented internal tooling and libraries",
                "Refactored legacy code adding transparency and maintainability",
                "Enhanced user experience by streamlining user workflow"
            ]},
        {"name": "Bow Wow Kitty, LLC", 
            "title": "Software Developer / Database Administrator", 
            "location": "Richmond, VA",
            "tenure": "04/2010 - 12/2017", 
            "responsibilities": [
                "Set up relational database to store client information", 
                "Designed secure, responsive web frontend to store client / billing information",
                "Maintained and improved software as business requirements evolved"
            ]}
    ]
}
